app/controllers/tasks_controller.rb

  def index
    new
    @tasks=Task.all
---
SELECT * FROM `tasks`

  def create
    @task=Task.new(params[:task])
    if @task.save
      flash[:notice]='Task was successfully created'
      redirect_to :action=>"index"
    else
      @task=Task.all
---
INSERT INTO `tasks` (`name`, `updated_at`, `finished`, `created_at`) VALUES('Learn Ruby and Rails', '2009-09-18 21:36:39', NULL, '2009-09-18 21:36:39')
SELECT * FROM `tasks`

  def finish
    @task=Task.find(params[:id])
    new={:finished=>true}
    @task.update_attributes(new)
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)
UPDATE `tasks` SET `finished` = 1, `updated_at` = '2009-09-18 21:37:13' WHERE `id` = 2

  def unfinish
    @task=Task.find(params[:id])
    new={:finished=>false}
    @task.update_attributes(new)
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
UPDATE `tasks` SET `finished` = 0, `updated_at` = '2009-09-18 21:40:55' WHERE `id` = 1

  def destroy
    @task=Task.find(params[:id])
    @task.destroy
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 3)
DELETE FROM `tasks` WHERE `id` = 3